Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And he said, Why are you sleeping? Get up, and give yourselves to prayer, so that you may not be put to the test.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ ᎢᏥᎵᎾᎠ? ᏗᏣᎴᎲᎦ ᎢᏣᏓᏙᎵᏍᏗ, ᎾᏍᎩ ᎤᏓᎴᎾᏍᏗᏱ ᎨᏒ ᏫᏥᏴᏍᏗᏱ ᏂᎨᏒᎾ.

source: And while he was saying these words, there came a band of people, and Judas, one of the twelve, was in front of them, and he came near to Jesus to give him a kiss.
chr: ᎠᏏᏉᏃ ᎧᏁᎨᎢ, ᎬᏂᏳᏉ ᎤᏂᏣᏘ, ᎾᏃ ᏧᏓᏏ ᏣᎪᏎᎮᎢ, ᎾᏍᎩ ᏔᎳᏚ ᎢᏯᏂᏛ ᎨᏒ ᎨᎳ, ᎢᎬᏱ ᎠᎢᏎ, ᎠᎴ ᎾᎥ ᎤᎷᏤᎴ ᏥᏌ ᏧᏔᏪᏙᏂᏎᎢ,

source: But Jesus said to him, Judas, will you be false to the Son of man with a kiss?
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏧᏓᏏ, ᎯᏯᏔᏬᏙᎲᏍᎬᏍᎪ ᎯᎶᏄᎡᏗᎭ ᏴᏫ ᎤᏪᏥ?

source: And when those who were with him saw what was coming, they said, Lord, may we not make use of our swords?
chr: ᎾᎥᏃ ᎠᏁᏙᎯ ᎤᎾᏙᎴᎰᏒ ᏄᏍᏛ ᏫᎬᏩᎵᏰᎢᎶᎯᏍᏗ ᎨᏒ, ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ, ᏣᎬᏫᏳᎯ, ᎠᏰᎳᏍᏗᏍᎪ-ᎦᏅᎯᏛ ᏙᏓᏲᏥᎷᏯᏍᏔᏂ?

source: And one of them gave a blow to the servant of the high priest, cutting off his right ear.
chr: ᎠᏏᏴᏫᏃ ᎤᎷᏰ ᏄᎬᏫᏳᏒ ᎠᏥᎸᎨᎶᎯ ᎤᏅᏏᏓᏍᏗ, ᎠᎴ ᎤᎵᏍᏕᏍᏔᏁ ᎠᎦᏘᏏ ᎦᎴᏂ.

source: But Jesus, answering, said, Put up with this, at least. And touching his ear, he made it well.
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎢ, ᎤᎾᏁᎳᎩ, ᎾᏍᎩᏉ ᎢᎦᎢ ᎤᏒᏁᎴᏃ ᎦᎴᏂ ᎠᎴ ᎤᏅᏩᏁᎢ

source: And Jesus said to the chief priests and the captains of the Temple and the rulers, who had come against him, Have you come out as against a thief, with swords and sticks?
chr: ᎿᏉᏃ ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ, ᎠᎴ ᎣᏍᏛ ᎢᏳᏅᎿᏕᎩ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᏗᏂᎳᏫᎩ, ᎾᏍᎩ ᎬᏩᏂᏴᎯᎸᎯ, ᎢᏥᎷᎩᏍᎪ ᎠᏓᎾᏌᎲᏍᎩ ᏤᏥᏲᎰ ᎾᏍᎩᏯᎢ, ᎠᏰᎳᏍᏗ-ᏗᎦᏅᎯᏛ ᎠᎴ ᎠᏓ ᏥᏕᏥᏁᎭ?

source: When I was in the Temple with you every day, your hands were not stretched out against me: but this is your hour, and the authority of the dark power.
chr: ᏂᏑᎩᏨᏂᏒ ᎢᏨᏰᎳᏗᏙᎲ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎥᏝ ᏱᏣᏁᎶᏔᏁ ᏍᎩᏂᏴᏗᏱ; ᎠᏎᏃ ᎢᏣᏤᎵᎦ ᎪᎯ ᏥᎩ, ᎠᎴ ᎤᎵᏏᎩ ᎤᎵᏂᎬᎬᎢ.

source: And they made him a prisoner and took him away to the house of the high priest. But Peter went after them at a distance.
chr: ᎿᏉᏃ ᎬᏩᏂᏴᎮᎢ, ᎠᎴ ᎬᏩᏘᏅᏎ ᎠᎴ ᏫᎬᏩᏴᏔᏁ ᏄᎬᏫᏳᏒ ᎠᏥᎸᎨᎶᎯ ᏗᎦᏁᎸᎢ. ᏈᏓᏃ ᎢᏅ ᎣᏂ ᏗᎵᏍᏓᏩᏗᏎᎢ.

source: And a fire was lighted in the middle of the open square, and they were seated together, and Peter was among them.
chr: ᎿᏉᏃ ᎤᏜᏅᏛ ᎠᏰᎵ ᎤᏃᏔᏅ, ᎠᎴ ᎢᏧᎳᎭ ᎤᎾᏅᏅ, ᏈᏓ ᎤᏪᏁ ᎠᏂᏅᎢ.

source: And a certain woman-servant, seeing him in the light of the fire, and looking at him with attention, said, This man was with him.
chr: ᎩᎶᏃ ᎢᏳᏍᏗ ᎠᏛ ᎤᎪᎲ ᎠᏥᎸᏳᎶᏗ ᎤᏬᎸᎢ, ᎠᎴ ᎤᏯᏅᏒᎯ ᏚᎧᎿᏅ, ᎯᎠ ᏄᏪᏎᎢ, ᎯᎠ ᎠᏍᎦᏯ ᎾᏍᏉ ᏓᏁᏙᎲᎩ ᎾᏍᎩ.

source: But he said, Woman, it is not true; I have no knowledge of him.
chr: ᎠᏎᏃ ᎤᏓᏱᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎯᎨᏴ, ᎥᏝ ᏱᏥᎦᏔᎭ ᎾᏍᎩ.

source: And after a little time, another saw him and said, You are one of them; and he said, Man, I am not.
chr: ᎪᎯᏱᏃ ᎢᏴᏛ ᏅᏩᏓᎴ ᎤᎪᎲ, ᎯᎠ ᏄᏪᏎᎢ, ᏂᎯ ᎾᏍᏉ ᎾᎿ ᎮᎸ ᎢᎩ. ᏈᏓᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎯᏍᎦᏯ, ᎥᏝ ᎠᏴ ᎾᎿ ᎨᎸ ᏱᎩ.

source: And after about an hour, another man said, with decision, Certainly this man was with him, for he is a Galilaean.
chr: ᎣᏂᏃ ᏑᏟᎶᏛ ᎢᏴᏛ ᎢᎪᎯᏛ, ᏅᏩᏓᎴ ᎾᏍᎩ ᎤᏙᎯᏳᎯ ᎨᏒ ᎤᏍᏓᏱᏕᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᎤᏙᎯᏳᎯ ᎯᎠ ᎾᏍᏉ ᏓᏁᏙᎲᎩ; ᎨᎵᎵᏰᏃ ᏕᎯ ᎢᎩ.

source: And Peter said, Man, I have no knowledge of these things of which you are talking. And straight away, while he was saying these words, there came the cry of a cock.
chr: ᏈᏓᏃ ᎯᎠ ᏄᏪᏎᎢ; ᎯᏍᎦᏯ, ᎥᏝ ᏱᎪᎵᎦ ᏂᏪᏍᎬᎢ. ᎩᎳᏉᏃ ᎢᏴᏛ, ᎠᏏᏉ ᎧᏁᎨᎢ, ᏣᏔᎦ ᎤᏴᎳᏎᎢ.

source: And the Lord, turning, gave Peter a look. And the words of the Lord came to Peter's mind, how he had said, This night, before the hour of the cock's cry, you will be false to me three times.
chr: ᎤᎬᏫᏳᎯᏃ ᎤᎦᏔᎲᏒ ᏚᎧᎿᏁ ᏈᏓ. ᏈᏓᏃ ᎤᏅᏓᏕ ᎤᏁᏨ ᎤᎬᏫᏳᎯ, ᎯᎠ ᏥᏄᏪᏎᎴᎢ; ᎠᏏᏉ ᏄᏴᎳᏒᎾ ᏣᏔᎦ ᏦᎢ ᏅᏓᏍᏆᏓᏱᎵ.

source: And he went out, weeping bitterly.
chr: ᎤᏄᎪᏤᏃ ᏈᏓ, ᎠᎴ ᎡᎯᏍᏗ ᏚᏠᏱᎴᎢ

source: And the men in whose hands Jesus was, made sport of him and gave him blows.
chr: ᎠᏂᏍᎦᏯᏃ ᏥᏌ ᏗᎬᏩᏂᏴᎯ ᎦᎬᏩᏐᏢᏕ ᎠᎴ ᏕᎬᏩᏂᎮᎢ.

source: And, covering his eyes, they said to him, Are you prophet enough to say who gave you that blow?
chr: ᏕᎬᏩᎦᏚᏢᏅᏃ ᎤᎧᏛ ᏕᎬᏩᏂᎮᎢ, ᎬᏩᏛᏛᎲᏍᎨ ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎭᏙᎴᎰᎯ, ᎦᎪ ᏥᏨᏂᎦ?

source: And they said a number of other evil things against him.
chr: ᎠᎴ ᎤᏣᏘ ᎠᏏ ᎢᏳᏓᎴᎩ ᎪᎱᏍᏗ ᎬᏬᏎᎮ ᎬᏩᏐᏢᎢᏍᏗᏍᎬᎢ.

source: And when it was day, the rulers of the people came together, with the chief priests and the scribes, and they took him before their Sanhedrin, saying,
chr: ᎢᎦᏉᏃ ᏄᎵᏍᏔᏅ ᏗᏂᎳᏫᎩ ᏴᏫ ᎠᏁᎲ ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᏚᏂᎳᏫᏤᎢ, ᎠᎴ ᏓᏂᎳᏫᎥ ᎬᏩᏘᏃᎴ ᎯᎠ ᏄᏂᏪᏎᎢ;

source: If you are the Christ, say so. But he said, If I say so you will not have belief;
chr: ᏂᎯᏍᎪ ᎦᎶᏁᏛ? ᏍᎩᏃᎲᏏ. ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎢᏳᏃ ᏱᏨᏃᏁᎸ ᎥᏝ ᏴᎨᏦᎯᏳᎲᎦ;

source: And if I put a question to you, you will not give an answer.
chr: ᎠᎴ ᎾᏍᏉ ᏱᏨᏯᏛᏛᏅ ᎥᏝ ᏴᎨᏍᎩᏁᏥ, ᎠᎴ ᎥᏝ ᏱᏙᎨᏍᎩᏲᎯ.

source: But in the future the Son of man will be seated at the right hand of the power of God.
chr: ᎢᎸᎯᏳ ᏛᏍᏆᎸᎯ ᏴᏫ ᎤᏪᏥ ᏓᎦᏂ ᎠᎦᏘᏏᏗᏢ ᎤᎵᏂᎩᏛ ᎤᏁᎳᏅᎯ ᎤᏬᎸᎢ.

source: And they all said, Are you then the Son of God? and he said, You say that I am.
chr: ᎿᏉᏃ ᎯᎠ ᏄᏂᏪᏎ ᏂᎦᏛ, ᏂᎯᏍᎪ ᎤᏁᎳᏅᎯ ᎤᏪᏥ? ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᏰᎵ ᏂᏥᏫ, ᎠᏴᏰᏃ ᎾᏍᎩ.

source: And they said, What more need have we of witness? we have the very words of his mouth.
chr: ᎯᎠᏃ ᏄᏂᏪᏎᎢ, ᎦᏙᏃ ᎢᎬᏙᏗ ᎠᏏ ᎪᎯᏳᏗᏍᎩ? ᎢᎬᏒᏰᏃ ᎡᏓᏛᎦᏏ ᎤᏩᏒ ᎧᏁᎬᎢ.

source: And they all went and took him before Pilate.
chr: ᏂᎦᏛᏃ ᎾᏍᎩ ᎤᏂᏣᏘ ᎨᏒ ᏚᎾᎴᏅ ᏆᎴᏗ ᏫᎬᏩᏘᏃᎮᎴᎢ.

source: And they made statements against him, saying, This man has to our knowledge been teaching our nation to do wrong, and not to make payment of taxes to Caesar, even saying that he himself is Christ, a king.
chr: ᎠᎴ ᎤᎾᎴᏅᎮ ᎬᏭᎯᏍᏗᏍᎨ ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎯᎠ ᎾᏍᎩ ᏙᏥᏩᏛᎲᎩ ᏕᏓᎴᎾᏍᏗᏍᎬᎩ ᏴᏫ, ᎠᎴ ᏕᎧᏅᏍᏓᏕᎲᎩ ᎠᏰᎵ ᎠᏕᎸ ᏏᏌ ᎠᎫᏴᎡᏗᏱ, ᎯᎠ ᏂᎧᏪᏍᎬᎩ, ᎠᏴ ᎠᎩᎬᏫᏳᎯ, ᎦᎶᏁᏛ.

source: And Pilate said to him, Are you the King of the Jews? And he said in answer, You say so.
chr: ᏆᎴᏗᏃ ᎤᏛᏛᏁ, ᎯᎠ ᏄᏪᏎᎢ, ᏂᎯᏍᎪ ᏣᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ? ᎤᏁᏤᎴᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎾᏍᎩ ᏂᏫ.

source: And Pilate said to the chief priests and the people, In my opinion this man has done no wrong.
chr: ᏆᎴᏗᏃ ᎯᎠ ᏂᎦᏪᏎᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏴᏫ, ᎥᏝ ᏱᏥᏩᏘ ᎤᏍᎦᏅᏨ ᎯᎠ ᎠᏍᎦᏯ.

source: But they became more violent than before, saying, He has made trouble among the people, teaching through all Judaea from Galilee to this place.
chr: ᎠᏎᏃ ᎤᏂᏍᏓᏱᏕ ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᏓᏖᎸᎲᏍᎦ ᎯᎠ ᏴᏫ, ᏓᏕᏲᏂᏙᎭ ᏧᏗᏱ ᏂᎬᎾᏛᎢ, ᎨᎵᎵ ᏅᏓᎬᏩᏓᎴᏅᏛ ᎠᏂ ᎢᏯᏍᏘ.

source: But at these words Pilate said, Is the man a Galilaean?
chr: ᏆᎴᏗᏃ ᎤᏛᎦᏅ ᎨᎵᎵ ᎠᏂᏁᎢᏍᏗᏍᎬ ᎤᏛᏛᏁ, ᎨᎵᎵᏍᎪ ᎡᎯ ᎯᎠ ᎠᏍᎦᏯ, ᎤᏛᏁᎢ.

source: And when he saw that he was under the authority of Herod, he sent him to Herod, who was in Jerusalem himself at that time.
chr: ᎤᏙᎴᎰᏒᏉᏃ ᎡᎶᏛ ᎤᎬᏫᏳᎯ ᎨᏒ ᎾᎿ ᎡᏗ ᎨᏒᎢ, ᎡᎶᏛ ᏭᏪᎧᏁᎴᎢ, ᎾᏍᎩ ᎡᎶᏛ ᎤᏩᏒ ᏥᎷᏏᎵᎻ ᎡᏙᎮ ᎾᎯᏳᎢ.

source: Now when Herod saw Jesus he was very glad, having for a long time had a desire to see him, for he had had accounts of him, and was hoping to see some wonders done by him.
chr: ᎡᎶᏛᏃ ᎤᎪᎲ ᏥᏌ, ᎤᏣᏘ ᎣᏎ ᎤᏰᎸᏁᎢ; ᎪᎯᏗᏳᏰᏃ ᏅᏩᏚᎵᏍᎨ ᎤᎪᏩᏛᏗᏱ, ᏅᏗᎦᎵᏍᏗᏙᏗᏍᎨ ᎤᏣᏘ ᏧᏓᎴᏅᏛ ᎠᏥᏃᎮᏍᎬ ᎤᏛᎦᏅᎢ, ᎠᎴ ᎤᏚᎩ ᎤᏩᏎ ᎤᎪᏩᏛᏗᏱ ᎪᎱᏍᏗ ᎤᏍᏆᏂᎪᏗ ᏚᎸᏫᏍᏓᏁᎲᎢ.

source: And he put a great number of questions to him, but he said nothing.
chr: ᎤᏛᏛᎮᎸᏁᏃ ᎤᏣᏘ ᏧᏓᎴᏅᏛ, ᎠᏎᏃ ᎥᏝ ᏳᏁᏤᎴᎢ.

source: And the chief priests and the scribes were there, making statements against him violently.
chr: ᏄᏂᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᏓᏂᏙᎨ ᎤᎵᏂᎩᏛ ᎬᏭᎯᏍᏗᏍᎨᎢ.

source: And Herod, with the men of his army, put shame on him and made sport of him, and dressing him in shining robes, he sent him back to Pilate.
chr: ᎡᎶᏛᏃ ᎠᎴ ᏧᏤᎵ ᎠᏂᏯᏫᏍᎩ ᎦᎬᏩᏐᏢᏔᏁᎢ, ᎠᎴ ᎬᏩᏕᎰᏔᏁᎢ, ᎠᎴ ᏗᎬᏩᎸᏌᏛ ᎠᏄᏬ ᎤᏂᏄᏬᎥ ᏆᎴᏗ ᏔᎵᏁ ᏭᏂᎧᏁᎴᎢ.

source: And that day Herod and Pilate became friends with one another, for before they had been against one another.
chr: ᎾᎯᏳᏃ ᎢᎦ ᏆᎴᏗ ᎠᎴ ᎡᎶᏛ ᎤᎾᎵᎢᏕᎢ; ᏗᎾᏓᏍᎦᎩᏳᏰᏃ ᎢᏳᎵᏍᏔᏅᎯ ᎨᏎ ᎾᎯᏳ ᎢᏯᏍᏘ.

source: And Pilate sent for the chief priests and the rulers and the people, and said to them,
chr: ᏆᎴᏗᏃ ᏚᎳᏫᏛ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ, ᎠᎴ ᏄᏂᎬᏫᏳᏌᏕᎩ, ᎠᎴ ᎤᏂᏣᏘ ᎨᏒ ᏴᏫ,

source: You say that this man has been teaching the people evil things: now I, after going into the question before you, see nothing wrong in this man in connection with the things which you have said against him:
chr: ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏍᎩᏯᏘᏃᎮᎸ ᎯᎠ ᎠᏍᎦᏯ ᏴᏫ ᏚᎾᏓᏅᏛ ᏗᎴᎾᏍᏗᏍᎩ ᎾᏍᎩᏯᎢ; ᎬᏂᏳᏉᏃ ᏥᎪᎵᏰᎥᎯ ᏥᎩ ᎢᏥᎦᏔᎲᎢ, ᎥᏝ ᎪᎱᏍᏗ ᏱᏥᏩᏘ ᎤᏍᎦᏅᏨ ᎯᎠ ᎠᏍᎦᏯ ᎾᏍᎩ ᏄᏍᏛ ᎡᏧᎢᏍᏗᏍᎬᎢ;

source: And Herod is of the same opinion, for he has sent him back to us; for, you see, he has done nothing for which I might put him to death.
chr: ᎡᎶᏛ ᎠᎴ ᎾᏍᏉ ᎥᏝ; ᎾᎿᏰᏃ ᎢᏤᏅᏍᏗᏱ ᎢᏨᏁᏤᎸᎩ; ᎬᏂᏳᏉᏃ ᎥᏝ ᎪᎱᏍᏗ ᏰᎵ ᎬᏩᏲᎱᎯᏍᏗ ᎨᏒ ᏱᏄᏛᏁᎸ.

source: And so I will give him punishment and let him go.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏥᎵᎥᏂᎸᎭ ᏓᏥᏯᎧᏂ.

source: But with loud voices they said all together, Put this man to death, and make Barabbas free.
chr: ᎤᏁᎷᏁᏃ ᏌᏉ ᎢᎦᎦᏛ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᎯᎷᎦ ᎯᎠ ᎠᏍᎦᏯ, ᏆᎳᏆᏃ ᏗᏍᎩᏲᎯᏏ.

source: Now this man was in prison because of an attack against the government in the town, in which there had been loss of life.
chr: ᎾᏍᎩ ᏆᎳᏆ ᎤᏓᏑᏰᏛ ᎤᎾᎵᏖᎸᏅ ᎾᎿ ᎦᏚᎲ ᎠᎴ ᎤᏓᎸᎢ ᎠᏥᏍᏛᏗᏍᏔᏁ ᏗᏓᏍᏚᏗᏱ ᎠᏥᏴᏔᏅᎯ ᎨᏎᎢ.

source: And Pilate again said to them that it was his desire to let Jesus go free.
chr: ᏆᎴᏗᏃ ᎤᏚᎵᏍᎬ ᏥᏌ ᎤᏪᎪᏗᏱ ᏅᏧᎵᏍᏙᏔᏁ ᏔᎵᏁ ᏚᏁᏤᎴᎢ.

source: But crying out they said, To the cross with him!
chr: ᎠᏎᏃ ᎤᏁᎷᏁ ᎯᎠ ᏄᏂᏪᏎᎢ, ᎯᏍᏛᎥᎦ, ᎯᏯᏛᎥᎦ.

source: And he said to them a third time, Why, what evil has he done? I see no reason for putting him to death: I will give him punishment and let him go.
chr: ᏦᎢᏁᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ, ᎦᏙ ᎤᏍᏗ ᎤᏲ ᏚᎸᏫᏍᏓᏁᎸ? ᎥᏝ ᏱᏥᏩᏛᎡᎭ ᎪᎱᏍᏗ ᏰᎵ ᎬᏩᏲᎱᎯᏍᏗ ᎨᏒᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᏓᏥᎵᎥᏂᎵ ᎠᎴ ᏙᏓᏥᏲᏏ.

source: But they went on crying out loudly, Let him be put to death on the cross. And they had their way.
chr: ᎠᏎᏃ ᎤᎾᏟᏂᎬᏁᎴ ᎠᏍᏓᏯ ᎠᏂᏁᎬᎢ, ᎠᏂᏔᏲᎯᎮ ᎠᎦᏛᏗᏱ. ᎾᏍᎩᏃ Ꮎ ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᏂᏁᎬ ᎤᎬᏫᏳᏤᎢ.

source: And Pilate gave his decision for their desire to be put into effect.
chr: ᏆᎴᏗᏃ ᎤᏁᏤ ᏄᏍᏛ ᎤᎾᏚᎵᏍᎬ ᎢᏳᎵᏍᏙᏗᏱ.

source: And in answer to their request, he let that man go free who had been in prison for acting against the government and causing death, and Jesus he gave up to their pleasure.
chr: ᎠᎴ ᏚᏪᎧᏁᎴ ᎾᏍᎩ ᏧᏂᏔᏲᎴᎢ, ᏗᏓᏍᏚᏗᏱ ᎠᏥᏴᏔᏅᎯ ᏥᎨᏎᎢ ᏧᏍᏛᏗᏍᎨ ᎤᏓᏑᏰᏛ ᎤᎾᎵᏖᎸᏅ ᎠᎴ ᎤᏓᎸᎢ; ᏥᏌᏍᎩᏂ ᏚᏲᎯᏎᎴ ᎤᎾᏚᎵᏍᎬ ᎢᏳᏅᏁᏗᏱ.

source: And while they were taking him away, they put their hands on Simon of Cyrene, who was coming from the country, and made him take the cross after Jesus.
chr: ᎬᏩᏘᏂᏎᏃ ᎤᏂᏂᏴᎮ ᎩᎶ ᎢᏳᏍᏗ ᏌᏩᏂ ᏧᏙᎢᏛ, ᏌᎵᏂ ᎡᎯ, ᏙᏗᎦᎶᎨᏒ ᏅᏓᏳᎶᏒᎯ, ᎾᏍᎩᏃ ᎤᎾᏃᏝᏗᏍᏔᏁ ᏧᏓᎿᏩᏛ, ᎾᏍᎩ ᏥᏌ ᎠᎢᏒ ᎣᏂᏗᏢ ᎤᏪᏅᏍᏗᏱ.

source: And a great band of people went after him, and of women making signs of grief and weeping for him.
chr: ᎬᏩᏍᏓᏩᏗᏎᏃ ᎤᏂᏣᏘ ᏴᏫ, ᎠᎴ ᎠᏂᎨᏴ, ᎾᏍᎩ ᎾᏍᏉ ᏓᏂᏴᎨ ᎠᎴ ᎬᏩᏍᎪᏂᎮᎢ.

source: But Jesus, turning to them, said, Daughters of Jerusalem, let not your weeping be for me, but for yourselves and for your children.
chr: ᏥᏌᏃ ᏚᎦᏔᎲᎡᎸ ᎯᎠ ᏄᏪᏎᎢ, ᎢᏥᎨᏴ ᏥᎷᏏᎵᎻ ᏧᏪᏥ, ᏞᏍᏗ ᎠᏴ ᏍᎩᏍᎪᏂᎸᎩ, ᎢᏨᏒᏍᎩᏂ ᏗᏣᏓᏍᎪᏂᎦ, ᎠᎴ ᏗᏤᏥ ᏗᏥᏍᎪᏂᎦ.

source: For the days are coming in which they will say, Happy are those who have had no children, whose bodies have never given birth, whose breasts have never given milk.
chr: ᎬᏂᏳᏰᏃ ᏛᎵᏰᎢᎶᎵ ᎢᎦ, ᎾᎯᏳ ᎯᎠ ᏅᏛᏂᏪᏏ, ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᏗᎾᎷᎸᎥᏍᎩ ᏂᎨᏒᎾ, ᎠᎴ ᏧᎾᏓᎾᏄᎪᏫᏒᎯ ᏂᎨᏒᎾ, ᎠᎴ ᏧᎾᏓᏍᏛᏅᎯ ᏂᎨᏒᎾ.

source: And they will say to the mountains, Come down on us, and to the hills, Be a cover over us.
chr: ᎿᏉᏃ ᏛᎾᎴᏅᎯ ᎯᎠ ᏂᏙᏛᏂᏪᏎᎵ ᏙᏓᎸᎢ, ᏍᎩᏯᏐᎥᎦ; ᎠᎴ ᏚᏌᎯᎸᎢ, ᏍᎩᏳᏢᎥᎦ.

source: For if they do these things when the tree is green, what will they do when it is dry?
chr: ᎢᏳᏰᏃ ᎢᏤ ᏡᎬ ᎾᏍᎩ ᏱᏅᏛᏅᏁᎵ, ᎦᏙ ᎬᏁᏗ ᎨᏎᏍᏗ ᎤᎧᏲᏛ ᏡᎬᎢ?

source: And two others, evil-doers, were taken with him to be put to death.
chr: ᎠᎴ ᎾᏍᏉ ᎠᏂᏔᎵ ᏅᏩᎾᏓᎴ ᎤᏲ ᏧᏂᎸᏫᏍᏓᏁᎯ ᎢᏧᎳᎭ ᏕᎨᎦᏘᏅᏎ ᏗᎨᏥᎢᏍᏗᏱ.

source: And when they came to the place which is named Golgotha, they put him on the cross, and the evil-doers, one on the right side, and the other on the left.
chr: ᏭᏂᎷᏨᏃ ᎧᏫᎵ ᏚᏙᎥᎢ, ᎾᎿ ᏓᏓᎿᏩᏍᏛ ᎬᏩᏛᏁᎢ, ᎠᎴ ᏚᎾᏛᏁ ᎤᏲᏧᏂᎸᏫᏍᏓᏁᎯ, ᎠᏏᏴᏫ ᎠᎦᏘᏏᏗᏢ, ᏐᎢᏃ ᎠᎦᏍᎦᏂ ᎢᏗᏢ.

source: And Jesus said, Father, let them have forgiveness, for they have no knowledge of what they are doing. And they made division of his clothing among them by the decision of chance.
chr: ᎿᏉᏃ ᏥᏌ ᎯᎠ ᏄᏪᏎᎢ, ᎡᏙᏓ, ᏘᏙᎵᎩ; ᎥᏝᏰᏃ ᏯᏂᎦᏔᎭ ᎾᎾᏛᏁᎲᎢ. ᎤᏂᏯᏙᎴᏃ ᎤᏄᏬ ᎠᎴ ᎠᎾᏎᏍᏗᏍᎨᎢ.

source: And the people were looking on. And the rulers made sport of him, saying, He was a saviour of others; let him do something for himself, if he is the Christ, the man of God's selection.
chr: ᏴᏫᏃ ᎤᎾᎴᎾᏫᏍᏕ ᏚᎾᎦᏙᏍᏕᎢ. ᏄᏂᎬᏫᏳᏌᏕᎩᏃ ᎾᏍᏉ ᏚᎾᎵᎪᏁᎴ ᎢᎬᏩᏕᎰᏔᏁᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎠᏂᏐᎢ ᏓᏍᏕᎵᏍᎬᎩ; ᎤᏩᏒ ᏩᎵᏍᏕᎸ ᎢᏳᏃ ᎦᎶᏁᏛ ᎤᏁᎳᏅᎯ ᎤᏑᏰᏛ ᎨᏎᏍᏗ.

source: And the men of the army made sport of him, coming to him and giving him bitter wine,
chr: ᎠᎴ ᎠᏂᏯᏫᏍᎩ ᎿᏍᏉ ᎦᎬᏩᏐᏢᏕᎢ, ᎬᏩᎷᏤᎮ ᎠᎴ ᎬᏩᏁᏁᎮ ᏧᏂᏦᏯᏍᏗ,

source: And saying, If you are the King of the Jews, get yourself free.
chr: ᎠᎴ ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎢᏳᏃ ᏂᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵ ᎤᎬᏫᏳᎯ ᎨᏎᏍᏗ, ᏨᏒ ᎭᎵᏍᏕᎸ.

source: And these words were put in writing over him, THIS IS THE KING OF THE JEWS.
chr: ᎠᎴ ᎾᏍᏉ ᎪᏪᎴ ᎤᎵᏍᏓᏛ ᎦᎸᎳᏗᏢ ᎠᏂᎪᎢ ᎤᏂᏬᏂᎯᏍᏗ, ᎠᎴ ᎠᏂᎶᎻ ᎤᏂᏬᏂᎯᏍᏗ, ᎠᎴ ᎠᏂᏈᎷ ᎤᏂᏬᏂᎯᏍᏗ ᎪᏪᎴ ᎯᎠ ᏂᎬᏁᎢ; ᎯᎠ ᎤᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ.

source: And one of the evil-doers on the cross, with bitter feeling, said to him, Are you not the Christ? Get yourself and us out of this.
chr: ᎠᏏᏴᏫᏃ ᎾᏍᎩ ᎤᏲ ᏧᏂᎸᏫᏍᏓᏁᎯ ᎾᏍᎩ ᏗᎨᎦᏛᏅᎯ ᎦᎬᏩᏐᏢᏕᎢ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ, ᎢᏳᏃ ᏂᎯ ᎦᎶᏁᏛ ᎨᏎᏍᏗ, ᎭᎵᏍᏕᎸ ᏨᏒ ᎠᎴ ᎠᏴ ᏍᎩᏂᏍᏕᎸ.

source: But the other, protesting, said, Have you no fear of God? for you have a part in the same punishment,
chr: ᏐᎢᏍᎩᏂ ᏧᏁᏨ ᎤᎬᏍᎪᎸᏁᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᏝᏍᎪ ᎤᏁᎳᏅᎯ ᏱᎾᏰᏍᎦ ᎤᏠᏱᏉ ᏕᏣᏚᎪᏓᏁᎸ ᏥᎩ?

source: And with reason; for we have the right reward of our acts, but this man has done nothing wrong.
chr: ᎠᏴᏍᎩᏂ ᎤᏙᎯᏳᎯ ᏚᏳᎪᏛᎢ; ᎠᏴᏰᏃ ᏕᎩᏂᎸᏫᏍᏓᏁᎸ ᏚᏳᎪᏛ ᎩᏂᏍᏛᏗᎭ, ᎯᎠᏍᎩᏂ ᎥᏝ ᎪᎱᏍᏗ ᎤᏣᏘᏂ ᎢᏳᏛᏁᎸᎯ ᏱᎩ.

source: And he said, Jesus, keep me in mind when you come in your kingdom.
chr: ᎯᎠᏃ ᏄᏪᏎᎴ ᏥᏌ, ᏣᎬᏫᏳᎯ, ᏍᏆᏅᏓᏛᎭ ᏫᎷᏨᎭ ᏣᏤᎵᎪᎯ.

source: And he said to him, Truly I say to you, Today you will be with me in Paradise.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎤᏙᎯᏳᎯᏯ ᎬᏲᏎᎭ, ᎪᎯ ᎢᎦ ᏥᎩ ᏫᏁᏙᎮᏍᏗ ᏅᏩᏙᎯᏯᏛ ᏗᎨᏒᎢ.

source: And it was now about the sixth hour; and all the land was dark till the ninth hour;
chr: ᏔᎳᏚᏃ ᎢᏴᏛ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒ ᎨᏎᎢ, ᎠᎴ ᏂᎬᎾᏛ ᎠᏂ ᎦᏙᎯ ᎤᎵᏏᎲᏎ ᏦᎢᏁ ᎢᏳᏟᎶᏛ ᎢᏯᏍᏘ.

source: The light of the sun went out, and the curtain in the Temple was parted in two.
chr: ᎠᎴ ᏅᏙ ᎤᎵᏏᎲᏎᎢ, ᎠᎴ ᎠᏄᏬ ᎠᏰᏙᎳᏛ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᏰᎵ ᏚᎵᏍᏡᏰᎢ.

source: And Jesus gave a loud cry and said, Father, into your hands I give my spirit: and when he had said this, he gave up his spirit.
chr: ᏥᏌᏃ ᎠᏍᏓᏯ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎢ, ᎡᏙᏓ, ᏂᎯ ᏕᎬᏲᎯᏏ ᎠᏆᏓᏅᏙᎩ; ᎾᏍᎩᏃ ᏄᏪᏒ ᎤᎵᏍᏆᏕᎴᎢ.

source: And when the captain saw what was done, he gave praise to God, saying, Without doubt this was an upright man.
chr: ᎠᏍᎪᎯᏧᏈᏃ ᏗᏓᏖᏁᎯ ᎤᎪᎲ ᏄᎵᏍᏔᏂᏙᎸᎢ ᎤᎸᏉᏔᏁ ᎤᏁᎳᏅᎯ ᎯᎠ ᏄᏪᏎᎢ, ᎤᏙᎯᏳᎯᏯ ᎤᏓᏅᏗ ᎠᏍᎦᏯ ᎨᏎ ᎯᎠ.

source: And all the people who had come together to see it, when they saw the things which were done, went back again making signs of grief.
chr: ᏂᎦᏛᏃ ᏴᏫ ᎾᎿ ᎠᎪᏩᏛᏗ ᎨᏒ ᎤᎾᎦᏙᏍᏔᏂᎸᎯ, ᎤᏂᎪᎲ ᏄᎵᏍᏔᏂᏙᎸ ᏚᏅᏂᎴ ᏗᏂᏁᏥᏱ, ᎠᎴ ᎤᎾᏨᏎᎢ.

source: And all his friends and the women who came with him from Galilee, were waiting at a distance, watching these things.
chr: ᏂᎦᏛᏃ ᎬᏩᎦᏔᎯ ᎨᏒ ᎠᎴ ᎠᏂᎨᏴ ᎨᎵᎵ ᏅᏓᎬᏩᏍᏓᏩᏛᏛ ᎢᏅ ᏧᎾᎴᏅᏁᎢ ᎠᏂᎪᏩᏘᏍᎨ ᎾᏍᎩ ᎯᎠ.

source: Now there was a man named Joseph, a man of authority and a good and upright man
chr: ᎬᏂᏳᏉᏃ ᎠᏍᎦᏯ ᏦᏩ ᏧᏙᎢᏛ, ᏗᎦᎳᏫᎩ, ᎤᏓᏅᏘ ᎠᏍᎦᏯ, ᎠᎴ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ,

source: (He had not given his approval to their decision or their acts), of Arimathaea, a town of the Jews, who was waiting for the kingdom of God:
chr: (ᎾᏍᎩ ᎥᏝ ᎣᏏᏳ ᏳᏰᎸᏁ ᎾᏍᎩ ᏄᏍᏛ ᏚᏄᎪᏔᏅ ᎠᎴ ᏄᎾᏛᏁᎸᎢ,) ᎠᎵᎹᏗᏱ ᎡᎯ ᎨᏎᎢ, ᎾᏍᎩ ᎠᏂᏧᏏ ᎤᏂᏚᎲᎢ, ᎾᏍᎩ ᎾᏍᏉ ᎠᎦᏘᏰ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒᎢ,^

source: This man went to Pilate and made a request for the body of Jesus.
chr: ᎯᎠ ᎾᏍᎩ ᎠᏍᎦᏯ ᏆᎴᏗ ᏭᎷᏤᎴ ᎠᎴ ᎤᏔᏲᏎᎴ ᏥᏌ ᎠᏰᎸᎢ.

source: And he took it down, and folding it in a linen cloth, he put it in a place cut in the rock for a dead body; and no one had ever been put in it.
chr: ᎠᎴ ᎤᏕᏒ ᏙᎴᏛ ᎠᏄᏬ ᎤᏪᏣᏄᎶᏔᏁᎢ, ᎠᎴ ᎠᏤᎵᏍᏛ ᎤᏅᏁ ᎾᏍᎩ ᏅᏲᎯ ᎠᏔᎴᏛ, ᎾᏍᎩ ᎾᎿ ᎢᎸᎯᏳ ᎩᎶ ᎾᏥᏅᏅᎾ ᎨᏒᎢ.

source: Now it was the day of making ready and the Sabbath was coming on.
chr: ᎾᎯᏳᏃ ᎢᎦ ᎠᏛᏅᎢᏍᏙᏗᏱ ᎨᏎᎢ, ᎤᎾᏙᏓᏆᏍᎬᏃ ᎿᏉ ᎤᎩᏥᏍᎨᎢ.

source: And the women who had come with him from Galilee went after him and saw the place and how his body had been put to rest;
chr: ᎠᏂᎨᏴᏃ ᎾᏍᏉ ᎨᎵᎵ ᏅᏓᎬᏩᏍᏓᏩᏛᏛ, ᎣᏂ ᎠᎾᎵᏍᏓᏩᏗᏎᎢ, ᎠᎴ ᎤᏂᎪᎮ ᎠᏤᎵᏍᏛᎢ, ᎠᎴ ᏂᎬᏅ ᎤᏂᏅᏅ ᎠᏰᎸᎢ.

source: And they went back and got ready spices and perfumes; and on the Sabbath they took their rest, in agreement with the law.
chr: ᎤᎾᏨᏎᏃ ᎠᎴ ᎤᎾᏓᏁᎳᏁ ᎦᏩᏒᎩ ᎠᎴ ᎠᏠᏁᏗ; ᎠᎴ ᎤᏂᏯᏪᏐᎴ ᎤᎾᏙᏓᏆᏍᎬ ᎾᏍᎩᏯ ᏂᎬᏅ ᏗᎧᎿᏩᏛᏍᏗ.

source: But on the first day of the week, at dawn, they came to the place where his body had been put, taking the spices which they had got ready.
chr: ᎢᎬᏱᏱᏃ ᎢᎦ ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒ ᎩᎳ ᎢᎦ ᏥᏂᎦᎵᏍᏗᏍᎪᎢ, ᎤᏂᎷᏤ ᎠᏤᎵᏍᏛᎢ, ᏚᏂᏲᎴ ᏗᎦᏩᏒᎩ ᎾᏍᎩ ᏧᎾᏓᏁᎳᏅᎯ, ᎠᎴ ᎩᎶ ᎢᏳᎾᏍᏗ ᎠᏁᎮᎢ.

source: And they saw that the stone had been rolled away.
chr: ᎤᏂᏩᏛᎮᏃ ᏅᏯ ᎢᏴᏛ ᏫᎦᏌᏆᎴᎸᏍᏔᏅᎯ ᎨᏎ ᎠᏤᎵᏍᏛᎢ.

source: And they went in, but the body of the Lord Jesus was not there.
chr: ᎤᏂᏴᎸᏃ ᎥᏝ ᏳᏂᎾᏩᏛᎮ ᎠᏰᎸ ᎤᎬᏫᏳᎯ ᏥᏌ.

source: And while they were in doubt about it, they saw two men in shining clothing by them:
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ ᎾᏍᎩ ᎤᏣᏘ ᎤᎾᏕᏯᏔᏁᎮ ᎾᏍᎩ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᎢ, ᎡᏂᏳᏉ ᎠᏂᏔᎵ ᎠᏂᏍᎦᏯ ᎾᎥ ᏚᎾᎴᏂᎴ ᏗᎬᏩᏔᎷᎩᏍᎩ ᏧᎾᏄᏩᎢ;

source: And while their faces were bent down to the earth in fear, these said to them, Why are you looking for the living among the dead?
chr: ᎠᏂᏍᎦᎢᎮᏃ ᎠᎴ ᎡᎳᏗ ᏂᏚᏅᏁ ᏚᎾᎧᏛᎢ, ᎾᏍᎩ ᎯᎠ ᏂᎬᏩᏂᏪᏎᎴᎢ, ᎦᏙᏃ ᎬᏃᏛ ᎢᎡᏥᏲᎭ ᏧᏂᏲᎱᏒᎯ ᏄᎾᏛᏅᎢ?

source: He is not here, he has come back to life: have in mind what he said to you when he was still in Galilee, saying,
chr: ᎥᏝ ᎠᏂ ᏱᎦᎾ, ᏚᎴᏅᏰᏃ; ᎢᏣᏅᏓᏓ ᏂᏥᏪᏎᎸᎢ ᎠᏏᏉ ᎨᎵᎵ ᏤᏙᎲᎩ,

source: The Son of man will be given up into the hands of evil-doers, and be put to death on the cross, and on the third day he will come back to life.
chr: ᎯᎠ ᏥᏂᎦᏪᏍᎬᎩ, ᏴᏫ ᎤᏪᏥ ᎠᏎ ᏴᏫ ᎠᏂᏍᎦᎾ ᏗᎨᏥᏲᎯᏎᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎠᎦᏛᏗ ᏓᏓᎾᏩᏍᏛᎢ, ᎠᎴ ᏦᎢᏁ ᎢᎦ ᏧᎴᎯᏐᏗ.

source: And his words came back into their minds,
chr: ᎤᎾᏅᏓᏕᏃ ᎤᏁᏨᎢ,

source: And they went away from that place and gave an account of all these things to the eleven disciples and all the others.
chr: ᎠᎴ ᎠᏤᎵᏍᏛ ᏗᎤᎾᏨᏎᎢ ᎾᏍᎩ ᎯᎠ ᏂᎦᏛ ᏄᎵᏍᏔᏂᏙᎸ ᏚᏂᏃᏁᎴ ᏌᏚ ᎢᏯᏂᏛ, ᎠᎴ ᏂᎦᏛ ᎠᏂᏐᎢ.

source: Now they were Mary Magdalene, and Joanna, and Mary, the mother of James: and the other women with them said these things to the Apostles.
chr: ᎾᏍᎩ ᎯᎠ ᎺᎵ ᎹᎩᏕᎵ ᎡᎯ, ᎠᎴ ᏦᎠᎾ, ᎠᎴ ᎺᎵ ᏥᎻ ᎤᏥ, ᎠᎴ ᏅᏩᎾᏓᎴ ᎠᏂᎨᏴ ᎠᏁᎯ, ᎾᏍᎩ ᏥᏫᎬᏩᏂᏃᏁᎴ ᎨᏥᏅᏏᏛ.

source: But these words seemed foolish to them, and they had no belief in them.
chr: ᎤᏂᏃᎮᎸᎯᏃ ᎠᏎᏉᏉ ᏅᏩᏍᏕᎢ, ᎠᎴ ᎥᏝ ᏱᎨᎪᎢᏳᏁᎢ.

source: But Peter got up and went to the place where the body had been put, and looking in he saw nothing but the linen cloths, and he went to his house full of wonder at what had taken place.
chr: ᏈᏓᏃ ᏚᎴᏅ, ᏚᏍᏆᎸᏔᏁ ᎠᏤᎵᏍᏛ ᏭᎶᏎᎢ; ᎤᏗᏍᏚᏅᏃ ᏚᎪᎮ ᏙᎴᏛ ᏗᏄᏬ ᎤᏁᎳᎩ ᎢᏴᏛ ᏙᎦᏁᎢ, ᎤᏓᏅᏎᏃ ᎠᏍᏆᏂᎪᏍᎨ ᎾᏍᎩ ᏄᎵᏍᏔᏂᏙᎸᎢ.

source: And then, two of them, on that very day, were going to a little town named Emmaus, which was about seven miles from Jerusalem.
chr: ᎠᎴ ᎬᏂᏳᏉ, ᎾᎯᏳᏉ ᎢᎦ ᎠᏂᏔᎵ ᎤᎾᏓᏍᏓᏩᏗᏙᎸᎯ ᏗᎦᏚᎲ ᎡᎺᏯᏏ ᏧᏙᎢᏛ ᏩᏂᎦᏖᎢ, ᎾᏍᎩ ᏧᏁᎳ ᎢᏴᏛ ᎢᏳᏟᎶᏛ ᏂᏚᏓᎴ ᏥᎷᏏᎵᎻ.

source: And they were talking together about all those things which had taken place.
chr: ᎠᎾᎵᏃᎮᏍᎬᏃ ᎠᏂᏃᎮᏍᎨ ᏂᎦᏛ ᎾᏍᎩ ᏄᎵᏍᏔᏂᏙᎸᎢ.

source: And while they were talking and questioning together, Jesus himself came near and went with them.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎾᏍᎩ ᎠᏏᏉ ᎠᎾᎵᏃᎮᏍᎨ ᎠᎴ ᏓᎾᏓᏛᏛᎲᏍᎨᎢ, ᏥᏌ ᎤᏩᏒ ᎾᎥ ᎤᎷᏨ ᎾᏍᎩ ᎤᏁᏅᏍᏔᏁᎢ.

source: But their eyes were not open that they might have knowledge of him.
chr: ᎠᏎᏃ ᏗᏂᎦᏙᎵ ᏕᎨᏥᏂᏴᎡᎴ ᎾᏍᎩ ᎬᏬᎵᏍᏗᏱ ᏂᎨᏒᎾ.

source: And he said to them, What are you talking about together while you go?
chr: ᎯᎠᏃ ᏂᏑᏪᏎᎴᎢ, ᎦᏙ ᎢᏍᏗᏃᎮᎭ ᎯᎠ ᎾᏍᎩ ᏥᏍᏓᎵᏃᎮᎭ ᎢᏍᏓᎢᏒᎢ ᎠᎴ ᎤᏲᏉ ᏥᏅᏩᏍᏗ ᏥᏍᏓᏓᏅᏔ?

source: Then stopping, and looking sadly at him, one of them, named Cleopas, said to him, Are you the only man living in Jerusalem who has not had news of the things which have taken place there at this time?
chr: ᎠᏏᏴᏫᏃ ᎾᏍᎩ ᏟᎣᏆ ᏧᏙᎢᏛ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏥᎪ ᎮᏙᎯᏉ ᏂᎯ ᏥᎷᏏᎵᎻ, ᎠᎴ ᏂᎦᏔᎲᎾᏉ ᎾᏍᎩ ᎾᎿ ᏄᎵᏍᏔᏂᏙᎸ ᎪᎯ ᏥᎩ?

source: And he said to them, What things? And they said, The things to do with Jesus of Nazareth, who was a prophet, great in his acts and his words, before God and all the people:
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎦᏙ ᎤᏍᏗ? ᎯᎠᏃ ᏂᎬᏩᏪᏎᎴᎢ, ᏥᏌ ᎾᏎᎵᏗ ᏤᎲᎩ ᏄᎵᏍᏓᏁᎸᎢ, ᎾᏍᎩ ᎠᏙᎴᎰᏍᎩ ᏥᎨᏒᎩ, ᎤᎵᏂᎩᏛ ᏚᎸᏫᏍᏓᏁᎸ ᎠᎴ ᏓᏕᏲᎲᏍᎬ ᏥᎨᏎ ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲ ᎠᎴ ᏂᎦᏛ ᏴᏫ ᎠᏂᎦᏔᎲᎢ.

source: And how the chief priests and our rulers gave him up to be put to death on the cross.
chr: ᎠᎴ ᎾᏍᎩ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸᎠᏁᎶᎯ ᎠᎴ ᏦᎦᏤᎵ ᏄᏂᎬᏫᏳᏌᏕᎩ ᏥᏕᎬᏩᏲᏎ ᏣᎫᎪᏓᏁᏗᏱ ᎤᏲᎱᎯᏍᏗᏱ, ᎠᎴ ᏥᎬᏩᏛᏅᎩ.

source: But we were hoping that he would be the Saviour of Israel. In addition to all this he has now let three days go by from the time when these things took place;
chr: ᎠᏎᏃ ᎤᏚᎩ ᎣᎬᏒᎩ ᎾᏍᎩ ᎢᏏᎵ ᏗᏓᏱᏍᎩ ᎨᏒᎢ. ᎠᎴ ᎾᏍᏉ ᎪᎯ ᎢᎦ ᏥᎩ ᏦᎢᏁ ᎤᎩᏥᎭ ᎾᏍᎩ ᎯᎠ ᎢᎬᏩᎵᏍᏔᏅᎯ;

source: And certain women among us gave us cause for wonder, for they went early to the place where his body had been put,
chr: ᎥᎥ, ᎠᎴ ᎾᏍᏉ ᎩᎶ ᎢᏳᎾᏍᏗ ᎠᏂᎨᏴ ᎣᎦᏓᏡᎬ ᎠᏁᎳ ᎤᏍᏆᏂᎪᏗ ᎪᎦᏓᏅᏓᏗᏍᏔᏅᎩ, ᎾᏍᎩ ᎩᎳ ᏧᎩᏥᏍᎪ ᎠᏤᎵᏍᏛ ᏭᏁᏙᎸᎯ;

source: And it was not there; then they came saying that they had seen a vision of angels who said that he was living.
chr: ᏭᎾᏠᏨᏃ ᎠᏰᎸᎢ, ᎤᏂᎷᏤᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏗᏂᎧᎿᏩᏗᏙᎯ ᎾᏍᏉ ᏙᏥᎪᏩᏛ ᎾᏍᎩ ᎬᏅ ᎪᎪᏏ, ᎤᎾᏛᏁᎢ.

source: And some of those who were with us went to the place, and saw that it was as the women had said, but him they did not see.
chr: ᎠᎴ ᎩᎶ ᎢᏳᏍᏗ ᎾᏍᎩ ᎣᏤᎯ ᎤᏁᏅᏒᎩ ᎠᏤᎵᏍᏛᎢ, ᎠᎴ ᏭᏂᏩᏛᎮ ᎾᏍᎩᏯ ᏄᏍᏕ ᎠᏂᎨᏴ ᏄᏂᏪᏒᎢ; ᎾᏍᎩᏍᎩᏂ Ꮎ ᎥᏝ ᏳᏂᎪᎮᎢ.

source: And he said, O foolish men! how slow you are to give belief to what the prophets have said.
chr: ᎿᏉᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎢᏥᏁᎫᏥ, ᎠᎴ ᎢᏣᏓᏅᏛ ᎢᏥᏍᎦᏃᎵᏳ ᎢᏦᎯᏳᏗᏱ ᏂᎦᎥ ᏄᏂᏪᏒ ᎠᎾᏙᎴᎰᏍᎩ!

source: Was it not necessary for the Christ to go through these things, and to come into his glory?
chr: ᏝᏍᎪ ᎯᎠ ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏎ ᎤᎩᎵᏲᎢᏍᏗ ᏱᎨᏎ ᎦᎶᏁᏛ, ᎠᎴ ᏭᏴᏍᏗ ᏱᎨᏎ ᎦᎸᏉᏗᏳ ᎤᏤᎵ ᏗᎨᏒᎢ.

source: And he made clear to them all the things in the Writings, from Moses and from all the prophets, which had to do with himself.
chr: ᎤᎴᏅᏔᏅᏃ ᎼᏏ, ᎠᎴ ᏂᎦᏛ ᎠᎾᏙᎴᎰᏍᎩ, ᏚᏬᏏᏌᏁᎴ ᎾᎦᎥ ᎪᏪᎸ ᎾᏍᎩ ᎤᏩᏒ ᎤᏃᎮᏍᎬᎢ.

source: And they came near the town to which they were going, and he seemed as if he was going on;
chr: ᎾᎥᏃ ᎤᏂᎷᏤ ᎦᏚᎲ ᎾᎿ ᏩᏂᎦᏛᎢ; ᎤᏟᏃ ᎢᏴᏛ ᏥᏮᏗᎦᎶᏏᏐ ᎢᏳᏍᏗ ᏄᏛᏁᎴᎢ.

source: But they kept him back, saying, Do not go, for evening is near, the day is almost gone. And he went in with them.
chr: ᎠᏎᏃ ᎢᎬᏩᏍᏗᏰᏔᏁᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᎠᏴ ᏍᎩᏂᏒᏏ, ᎿᏉᏰᏃ ᎤᏒᎯᏰᎯᏳ, ᎠᎴ ᎡᎳᏗᏳ ᏫᎧᎳ. ᎤᏴᎴᏃ ᏙᏗᏒᏎᎵᏎᎢ.

source: And when he was seated with them at table, he took the bread, and said words of blessing and, making division of it, he gave it to them.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎾᏍᎩ ᎦᏅᎨᎢ ᏗᎾᎵᏍᏓᏴᏂᏎᎢ, ᎦᏚ ᎤᎩᏒ ᎤᎵᎮᎵᏤᎢ, ᎠᎴ ᎤᎬᎭᎷᏴ ᏚᏁᎴᎢ.

source: And then their eyes were open, and they had knowledge of him, but he went from their view.
chr: ᏗᏂᎦᏙᎵᏃ ᏚᎵᏍᏚᎢᏎᎢ, ᎠᎴ ᎢᎬᏬᎵᏤᎢ, ᎠᎴ ᎤᎵᏛᏔᏁ ᏓᏂᎧᏅᎢ.

source: And they said to one another, Were not our hearts burning in us while he was talking to us on the way, making clear to us the holy Writings?
chr: ᎯᎠᏃ ᏂᏚᎾᏓᏪᏎᎴᎢ, ᏝᏍᎪ ᏗᎩᏂᎾᏫ ᏧᏗᎴᎩᏳ ᏱᎨᏎ ᎭᏫᏂ ᏥᎩᎾᎵᏃᎮᏗᏍᎬ ᏗᏓᎢᏒᎢ, ᎠᎴ ᏥᏕᎩᏃᏏᏌᏁᎲ ᎪᏪᎵ?

source: And that very hour they got up and went back to Jerusalem, where the eleven and the others had come together.
chr: ᎾᎯᏳᏉᏃ ᎠᎵᏰᎢᎵᏒ ᏚᎾᎴᏁᎢ, ᎠᎴ ᏥᎷᏏᎵᎻ ᏔᎵᏁ ᏫᎤᏂᎶᏎᎢ, ᎠᎴ ᏚᏂᏩᏛᎮ ᏓᏂᎳᏫᎡ ᏌᏚ ᎢᏯᏂᏛ, ᎠᎴ ᎾᏍᎩ ᎬᏩᎾᏓᏡᏩᏍᏗᏕᎩ,

source: And they said to them, The Lord has truly come back to life again, and Simon has seen him.
chr: ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎤᎬᏫᏳᎯ ᏚᎴᏅ ᎤᏙᎯᏳᎯ, ᎠᎴ ᏌᏩᏂ ᎬᏂᎨᏒ ᏄᏛᏁᎸ.

source: And they gave an account of the things which had taken place on the way, and how, when he gave them bread, they had knowledge of him.
chr: ᎠᎴ ᎤᏂᏃᎮᎴ ᏄᎵᏍᏔᏂᏙᎸ ᎠᎾᎢᏒᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏃᎵᏍᏔᏅ ᎦᏚ ᎠᎬᎭᎷᏯᏍᎬᎢ.

source: And while they were saying these things, he himself was among them, and said to them, Peace be with you!
chr: ᎠᏏᏉᏃ ᎾᏍᎩ ᎾᏂᏪᏍᎨᎢ, ᏥᏌ ᎤᏩᏒ ᎤᎴᏂᎴ ᎠᏰᎵ ᎠᏂᏅᎢ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏅᏩᏙᎯᏯᏛ ᎢᏣᏤᎵᎦ ᎨᏎᏍᏗ.

source: But they were full of fear, being of the opinion that they were seeing a spirit.
chr: ᎠᏎᏃ ᎤᏂᎾᏰᏎᎢ, ᎠᎴ ᎤᏂᏍᎦᎴᎢ, ᎠᏓᏅᏙ ᎣᏥᎪᏩᏛ ᎠᏁᎵᏍᎨᎢ.

source: And he said to them, Why are you troubled, and why are your hearts full of doubt?
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ ᎢᏣᏕᏯᏔᏁᎭ? ᎠᎴ ᎦᏙᏃ ᏧᏢᏫᏛ ᏂᏣᎵᏍᏓᏁ ᏙᏗᏣᏓᏅᏛᎢ?

source: See; my hands and my feet: it is I myself; put your hands on me and make certain; for a spirit has not flesh and bones as you see that I have.
chr: ᏗᏣᎧᏅᎦ ᏗᏉᏰᏂ ᎠᎴ ᏗᏆᎳᏏᏕᏂ, ᎠᏋᏒᏉ ᎯᎠ ᏥᎾᏆᏛᏅ; ᏍᎩᏯᏒᏂᎦ ᎠᎴ ᎢᏣᏙᎴᎰᎯ; ᎠᏓᏅᏙᏰᏃ ᎥᏝ ᏳᏇᏓᎳ, ᎠᎴ ᎥᏝ ᏧᎪᎳ ᏱᏚᎸ ᎾᏍᎩᏯ ᏥᏥᎪᏩᏘᎭ ᎠᏴ ᏂᏓᏋᏅᎢ.

source: And when he had said this, he let them see his hands and his feet.
chr: ᎾᏍᎩᏃ ᏄᏪᏒ ᏚᎾᏄᎪᏫᏎᎴ ᏧᏬᏰᏂ ᎠᎴ ᏧᎳᏏᏕᏂ.

source: And because, for joy and wonder, they were still in doubt, he said to them, Have you any food here?
chr: ᎠᏏᏉᏃ ᎾᏃᎯᏳᎲᏍᎬᎾ ᎨᏎ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎠᎾᎵᎮᎵᎬᎢ, ᎠᎴ ᎤᏂᏍᏆᏂᎪᏍᎨᎢ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎠᎵᏍᏓᏴᏗᏍᎪ ᎠᏂ ᎢᏥᎭ?

source: And they gave him a bit of cooked fish.
chr: ᎬᏩᏅᏁᎴᏃ ᎠᎬᎭᎸᏛ ᎠᏣᏗ ᎠᏒᎾᏘᎶᏛ, ᎠᎴ ᎠᎬᎭᎸᏛ ᏩᏚᎵᏏ.

source: And before their eyes he took a meal.
chr: ᏑᏁᏎᏃ, ᎠᎴ ᎤᎵᏍᏓᏴᏁ ᎠᏂᎦᏔᎲᎢ.

source: And he said to them, These are the words which I said to you when I was still with you, how it was necessary for all the things which are in the writings of Moses and the prophets and in the Psalms about me, to be put into effect.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎯᎠ ᎾᏍᎩ ᏥᏂᏨᏪᏎᎸᎩ, ᎠᏏᏉ ᏥᏨᏰᎳᏗᏙᎲᎩ, ᎾᏍᎩ ᏂᎦᎥ ᎾᏍᎩ ᎠᏎ ᎢᏳᎵᏍᏙᏗ ᎨᏒᎢ ᎪᏪᎳᏅᎯ ᎨᏒ ᏗᎧᎿᏩᏛᏍᏗᏱ ᎼᏏ ᎤᏤᎵᎦ, ᎠᎴ ᎠᎾᏙᎴᎰᏍᎩ ᏚᏃᏪᎸᎢ, ᎠᎴ ᏗᎧᏃᎩᏍᏗᏱ, ᎠᏴ ᎬᎩᏃᎮᏍᎬᎢ.

source: Then he made the holy Writings clear to their minds.
chr: ᎿᏉᏃ ᏚᏍᏚᎢᎡᎴ ᏚᎾᏓᏅᏛᎢ, ᎾᏍᎩ ᏧᏃᎵᏍᏗᏱ ᎪᏪᎵ;
